{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "SeparableConv2D", "config": {"name": "separable_conv2d", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "pointwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "pointwise_regularizer": null, "depthwise_constraint": null, "pointwise_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of13.bin", "group1-shard2of13.bin", "group1-shard3of13.bin", "group1-shard4of13.bin", "group1-shard5of13.bin", "group1-shard6of13.bin", "group1-shard7of13.bin", "group1-shard8of13.bin", "group1-shard9of13.bin", "group1-shard10of13.bin", "group1-shard11of13.bin", "group1-shard12of13.bin", "group1-shard13of13.bin"], "weights": [{"name": "dense/kernel", "shape": [788544, 64], "dtype": "float32", "quantization": {"min": -0.045099464117311965, "scale": 0.0003523395634164997, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.012720242920605574, "scale": 0.00010015939307563445, "dtype": "uint8"}}]}, {"paths": ["group2-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [64, 1], "dtype": "float32", "quantization": {"min": -0.19928988288430607, "scale": 0.0015569522100336412, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32", "quantization": {"min": -0.012774691917002201, "scale": 1.0, "dtype": "uint8"}}]}, {"paths": ["group3-shard1of1.bin"], "weights": [{"name": "separable_conv2d/depthwise_kernel", "shape": [3, 3, 3, 1], "dtype": "float32", "quantization": {"min": -0.42460166484701867, "scale": 0.003241234082801669, "dtype": "uint8"}}, {"name": "separable_conv2d/pointwise_kernel", "shape": [1, 1, 3, 64], "dtype": "float32", "quantization": {"min": -0.35515291410333966, "scale": 0.002690552379570755, "dtype": "uint8"}}, {"name": "separable_conv2d/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.09723466308604853, "scale": 0.00040179612845474597, "dtype": "uint8"}}]}]}
