{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["acc"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "dense/kernel", "shape": [150528, 128], "dtype": "float32", "quantization": {"min": -0.007309196670265758, "scale": 5.8009497383061576e-05, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.0006303456201053717, "scale": 5.836533519494183e-06, "dtype": "uint8"}}]}, {"paths": ["group2-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [128, 1], "dtype": "float32", "quantization": {"min": -0.19744616910523058, "scale": 0.0015923078153647627, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.00022270571207627654, "scale": 1.0, "dtype": "uint8"}}]}]}